#include <iostream>
using namespace std;

int main{
  cout<<"Це програма гри 'Морский бій'. \n";
  cout<<"Доступно два режима: гра проти людині і проти комп'ютера. \n";
  cout<<"Ціль гри потопити всі кораблі противника раніше за нього. \n";
  cout<<"______________________________________________________________ \n";
  cout<<"Гра відбувається на полі 10х10 \n";
  cout<<"Загалом є десять кораблів: \n";
  cout<<"  1 корабель — ряд із 4 клітин \n";
  cout<<"  2 кораблі — ряд із 3 клітин \n";
  cout<<"  3 кораблі — ряд із 2 клітин \n";
  cout<<"  4 кораблі — 1 клітина \n";
}
